Revit 2024 API
BuiltInFailures.AutoRouteFailures.NotAllPartsWereConvertedCannotAddPlaceholderWarning Property
 Not all parts were converted. Placeholders could not be added to fill the gap (the gap was too small). Check the fabrication service definition for the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotAllPartsWereConvertedCannotAddPlaceholderWarning { get; }
Visual Basic
Public Shared ReadOnly Property NotAllPartsWereConvertedCannotAddPlaceholderWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotAllPartsWereConvertedCannotAddPlaceholderWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace